In [49]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [50]:
dataset = pd.read_csv('train.csv')
X = dataset.loc[:,['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch','Embarked']]

In [51]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
X.iloc[:,2] = le.fit_transform(X.iloc[:,2])

In [53]:
dataset

     PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Cabin Embarked
0              1         0       3    male  22.0      1      0   NaN        S
1              2         1       1  female  38.0      1      0   C85        C
2              3         1       3  female  26.0      0      0   NaN        S
3              4         1       1  female  35.0      1      0  C123        S
4              5         0       3    male  35.0      0      0   NaN        S
..           ...       ...     ...     ...   ...    ...    ...   ...      ...
886          887         0       2    male  27.0      0      0   NaN        S
887          888         1       1  female  19.0      0      0   B42        S
888          889         0       3  female   NaN      1      2   NaN        S
889          890         1       1    male  26.0      0      0  C148        C
890          891         0       3    male  32.0      0      0   NaN        Q

[891 rows x 9 columns]

In [62]:
X

     PassengerId  Pclass  Sex   Age  SibSp  Parch Embarked
0              1       3    1  22.0      1      0        S
1              2       1    0  38.0      1      0        C
2              3       3    0  26.0      0      0        S
3              4       1    0  35.0      1      0        S
4              5       3    1  35.0      0      0        S
..           ...     ...  ...   ...    ...    ...      ...
886          887       2    1  27.0      0      0        S
887          888       1    0  19.0      0      0        S
888          889       3    0   NaN      1      2        S
889          890       1    1  26.0      0      0        C
890          891       3    1  32.0      0      0        Q

[891 rows x 7 columns]

In [64]:
#removing all the null values from the emarked column
for i in range(891):
    if X['Embarked'][i] not in ['S', 'C', 'Q']:
        X.loc[i,'Embarked'] = 'S'

In [66]:
X.Embarked = X.Embarked.astype(str)

In [68]:
#LabelEncoding Embarked
emb = LabelEncoder()
X['Embarked'] = X['Embarked'].dropna()
X.iloc[:,6] = emb.fit_transform(X.iloc[:,6])
X

     PassengerId  Pclass  Sex   Age  SibSp  Parch  Embarked
0              1       3    1  22.0      1      0         2
1              2       1    0  38.0      1      0         0
2              3       3    0  26.0      0      0         2
3              4       1    0  35.0      1      0         2
4              5       3    1  35.0      0      0         2
..           ...     ...  ...   ...    ...    ...       ...
886          887       2    1  27.0      0      0         2
887          888       1    0  19.0      0      0         2
888          889       3    0   NaN      1      2         2
889          890       1    1  26.0      0      0         0
890          891       3    1  32.0      0      0         1

[891 rows x 7 columns]

In [71]:
#changing the null values from the age to the mean of the age data
X['Age'] = X['Age'].fillna(X['Age'].mean())

In [72]:
X

     PassengerId  Pclass  Sex        Age  SibSp  Parch  Embarked
0              1       3    1  22.000000      1      0         2
1              2       1    0  38.000000      1      0         0
2              3       3    0  26.000000      0      0         2
3              4       1    0  35.000000      1      0         2
4              5       3    1  35.000000      0      0         2
..           ...     ...  ...        ...    ...    ...       ...
886          887       2    1  27.000000      0      0         2
887          888       1    0  19.000000      0      0         2
888          889       3    0  29.699118      1      2         2
889          890       1    1  26.000000      0      0         0
890          891       3    1  32.000000      0      0         1

[891 rows x 7 columns]

In [73]:
y = dataset.iloc[:,1]

In [74]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [75]:
#splitting the data into training and test set
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2, random_state = 0)

In [76]:
print(X_train)

     PassengerId  Pclass  Sex        Age  SibSp  Parch  Embarked
140          141       3    0  29.699118      0      2         0
439          440       2    1  31.000000      0      0         2
817          818       2    1  31.000000      1      1         0
378          379       3    1  20.000000      0      0         0
491          492       3    1  21.000000      0      0         2
..           ...     ...  ...        ...    ...    ...       ...
835          836       1    0  39.000000      1      1         0
192          193       3    0  19.000000      1      0         2
629          630       3    1  29.699118      0      0         1
559          560       3    0  36.000000      1      0         2
684          685       2    1  60.000000      1      1         2

[712 rows x 7 columns]